cask_args appdir: '/Applications'

tap 'homebrew/bundle'
# tap 'puma/puma' Need to look into how this could replace simple python server

brew 'grc' # beautifies log files
brew 'imagemagick' # manipulate images
brew 'jp2a' # jpeg to ascii
brew 'jq' # json preprocessor https://stedolan.github.io/jq/tutorial/
brew 'ruby'
brew 'node'
brew 'unrar'
brew 'wget' # retreive http files
brew 'yarn' # node module manager by facebook
brew 'youtube-dl'

cask '1password'
cask 'alfred'
cask 'cloud'
cask 'divvy'
cask 'dropbox'
cask 'flux'
cask 'github-desktop'
cask 'google-chrome'
cask 'itsycal'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'transmission'
cask 'tunnelbear'